In [226]:
# Initialize the workspace
from pymongo import MongoClient
import pprint
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
plt.style.use('fivethirtyeight')

In [3]:
client = MongoClient()

In [4]:
db = client['eia_data']

In [5]:
oil_produced = db['oil_produced']
natural_gas_produced = db['natural_gas_produced']
natural_gas_flared = db['natural_gas_flared']

In [7]:
oil_produced.count_documents({})

1

In [104]:
df_op = pd.DataFrame(oil_produced.find())
df_op.to_csv('/home/ubuntu/wasted_energy/df_op.csv')

In [105]:
df_ngf = pd.DataFrame(natural_gas_flared.find())
df_ngf.to_csv('/home/ubuntu/wasted_energy/df_ngf.csv')

In [106]:
df_ngp = pd.DataFrame(natural_gas_produced.find())
df_ngp.to_csv('/home/ubuntu/wasted_energy/df_ngp.csv')

In [108]:
pd.read_csv('/home/ubuntu/wasted_energy/csv_files/df_op.csv')
pd.read_csv('/home/ubuntu/wasted_energy/csv_files/df_ngp.csv')
pd.read_csv('/home/ubuntu/wasted_energy/csv_files/df_ngf.csv')

,Unnamed: 0,_id,us,alaska,alaska onshore,alaska state offshore,arkansas,california,california onshore,california state offshore,...,michigan,mississippi,missouri,nebraska,nevada,new york,oregon,south dakota,tennessee,virginia
0,0,5f16fb110a23ba36aa93a1db,"['', '', '', '', '', '', '392,528', '526,159',...","['', '', '', '', '', '', '', '11,390', '24,258...","['', '', '9,481', '11,262', '8,733', '7,105', ...","['', '', '4,616', '11,224', '4,507', '1,631', ...","['', '', '', '', '', '', '', '997', '895', '1,...","['', '', '', '', '', '', '', '3,565', '2,780',...","['', '', '751', '580', '830', '1,250', '1,268'...","['', '', '', '0', 'NA', 'NA', 'NA', 'NA', '0',...",...,"['', '', '', '', '', '', '', '1,861', '1,120',...","['', '', '', '', '', '', '', '7,098', '5,910',...","['', '', '', '', '', '', '', '0', 'NA', 'NA', ...","['', '', '', '', '', '', '', '0', '0', '0', '0...","['', '0', '', '', '', '', '', '', '', '', '', ...","['', '', '', '', '', '', '', '0', '0', '0', '0...","['', '', '', '', '', '', '-', '0', '0', '0', '...","['', '', '', '', '', '', '', '0', '0', '0', '0...","['', '', '', '', '', '', '', '0', '0', '0', '0...","['', '', '', '', '', '', '', '0', '0', '0', '0..."

In [110]:
df_op = df_op.loc[ : , 'us' : ]
df_ngp = df_ngp.loc[ : , 'us' : ]
df_ngf = df_ngf.loc[ : , 'us' : ]

In [112]:
op_cols = df_op.columns
for val in df_op["us"]:
    us_ = val[130:]

In [113]:
df_op_exp = df_op.set_index('us').apply(lambda x: pd.Series(x[0]))
df_ngp_exp = df_ngp.set_index('us').apply(lambda x: pd.Series(x[0]))
df_ngf_exp = df_ngf.set_index('us').apply(lambda x: pd.Series(x[0]))

TypeError: unhashable type: 'list'

Exception ignored in: 'pandas._libs.index.IndexEngine._call_map_locations'
Traceback (most recent call last):
  File "pandas/_libs/hashtable_class_helper.pxi", line 1652, in pandas._libs.hashtable.PyObjectHashTable.map_locations
TypeError: unhashable type: 'list'

TypeError: unhashable type: 'list'

Exception ignored in: 'pandas._libs.index.IndexEngine._call_map_locations'
Traceback (most recent call last):
  File "pandas/_libs/hashtable_class_helper.pxi", line 1652, in pandas._libs.hashtable.PyObjectHashTable.map_locations
TypeError: unhashable type: 'list'

TypeError: unhashable type: 'list'

Exception ignored in: 'pandas._libs.index.IndexEngine._call_map_locations'
Traceback (most recent call last):
  File "pandas/_libs/hashtable_class_helper.pxi", line 1652, in pandas._libs.hashtable.PyObjectHashTable.map_locations
TypeError: unhashable type: 'list'

In [114]:
#clean up oil produced data
df_op_exp.insert(0, 'year', range(1980, 2020)) 
df_op_exp.insert(1, 'us', us_)
df_op_exp.drop(0, axis=0, inplace=True)
for col_name in ['padd 1', 'padd 2', 'padd 3', 'padd 4', 'padd 5']:
    df_op_exp.drop(col_name, axis=1, inplace=True)

In [147]:
df_op_exp.head()

,year,us,florida,new york,pennsylvania,virginia,west virginia,illinois,indiana,kansas,...,montana,utah,wyoming,alaska,south alaska,north slope,arizona,california,nevada,federal offshore (padd 5)
1,1981,"3,128,624","34,773",841,"3,729",13,"3,473","24,090","4,721","65,810",...,"30,813","25,860","130,563","587,337","31,072","556,265",357,"365,370",700,"19,588"
2,1982,"3,156,715","25,626",834,"4,282",49,"3,227","27,710","5,563","70,525",...,"30,921","22,440","118,300","618,910","27,404","591,506",335,"373,176",613,"28,396"
3,1983,"3,170,999","19,476",831,"4,282",65,"3,628","29,200","5,321","71,594",...,"29,225","29,534","118,303","625,527","24,769","600,758",237,"374,161",810,"30,527"
4,1984,"3,249,696","14,462",840,"4,284",32,"3,524","28,868","5,526","75,729",...,"29,761","34,689","124,269","630,401","21,983","608,418",215,"381,621","1,907","30,399"
5,1985,"3,274,553","11,458","1,071","4,851",26,"3,555","30,265","5,168","75,407",...,"29,768","40,792","128,514","666,233","16,946","649,287",175,"394,002","3,039","29,875"

In [264]:
#clean up NG produced data
#df_ngp_exp.insert(0, 'year', range(1960, 2020)) 
#df_ngp_exp.insert(1, 'us', x[30:])

def clean_dfs(df, earliest_year): #make function to clean dataframes
    n = 2020 - earliest_year #length of longest data series
    df_cols = df.columns
    df_clean = pd.DataFrame({'year': range(earliest_year, 2020)}) # initialize new df w/ ealiest starting year - 2019
    for c in df_cols:
        for val in df[c]:
            diff = n - len(val)
            #print(pd.Series(list(np.zeros(diff))+val))
            data = list(np.zeros(diff)) + val
            df_clean[c] = pd.Series(data)

    return df_clean

In [272]:
df_op_clean = clean_dfs(df_op, 1850)
df_op_clean.tail(10)

,year,us,padd 1,florida,new york,pennsylvania,virginia,west virginia,padd 2,illinois,...,utah,wyoming,padd 5,alaska,south alaska,north slope,arizona,california,nevada,federal offshore (padd 5)
160,2010,"2,001,756","7,251","1,777",381,"3,238",12,"1,842","252,712","9,067",...,"24,663","53,890","441,444","218,904","3,766","215,138",37,"200,370",426,"21,707"
161,2011,"2,068,316","7,986","2,023",375,"3,431",11,"2,146","305,261","9,158",...,"26,305","54,515","421,263","204,829","3,737","201,092",37,"196,172",408,"19,817"
162,2012,"2,385,703","9,398","2,135",362,"4,319",9,"2,573","419,903","9,733",...,"30,210","57,808","407,710","192,401","4,080","188,322",52,"197,211",368,"17,678"
163,2013,"2,734,901","15,096","2,174",366,"5,307",10,"7,239","518,137","9,539",...,"35,016","63,482","405,803","187,923","5,424","182,499",60,"198,928",334,"18,559"
164,2014,"3,207,209","19,775","2,227",356,"6,849",14,"10,330","636,357","9,546",...,"40,909","76,119","404,684","181,130","6,601","174,529",56,"204,699",316,"18,482"
165,2015,"3,445,138","21,164","2,208",286,"7,088",11,"11,572","693,876","9,520",...,"37,136","86,472","389,261","176,229","6,686","169,542",37,"201,284",281,"11,430"
166,2016,"3,235,183","16,075","1,934",225,"6,272",7,"7,636","614,187","8,639",...,"30,528","72,647","371,884","179,378","5,643","173,735",8,"186,079",277,"6,143"
167,2017,"3,413,417","18,145","1,923",184,"6,562",7,"9,469","632,311","8,314",...,"34,438","75,718","359,962","180,547","5,272","175,275",13,"173,403",286,"5,713"
168,2018,"4,011,521","20,160","1,839",221,"6,478",5,"11,618","741,560","8,420",...,"37,063","87,955","349,105","174,800","5,563","169,237",11,"169,166",255,"4,874"
169,2019,"4,464,808","24,839","1,784",221,"6,325",4,"16,506","806,086","8,243",...,"37,442","101,656","336,282","169,947","5,211","164,737",7,"161,485",261,"4,582"

In [273]:
df_ngp_clean = clean_dfs(df_ngp, 1930)
df_ngp_clean.tail(10)

,year,us,us offshore,us state offshore,federal offshore us,alaska,alaska onshore,alaska offshore,alaska state offshore,arkansas,...,michigan,mississippi,missouri,nebraska,nevada,new york,oregon,south dakota,tennessee,virginia
80,2010,"26,816,085","2,875,945","575,601","2,300,344","3,197,100","2,826,952","370,148","370,148","927,479",...,"136,782","401,660",NA,"2,255",4,"35,813","1,407","12,540","5,144","147,255"
81,2011,"28,479,026","2,416,644","549,151","1,867,492","3,162,922","2,798,220","364,702","364,702","1,076,757",...,"143,826","443,351",NA,"1,980",3,"31,124","1,344","12,449","4,851","151,094"
82,2012,"29,542,313","2,044,643","489,505","1,555,138","3,164,791","2,857,485","307,306","307,306","1,146,168",...,"129,333","452,915",NA,"1,328",4,"26,424",770,"15,085","5,825","146,405"
83,2013,"29,522,551","1,859,469","505,318","1,354,151","3,215,358","2,882,956","332,402","332,402","1,139,654",...,"123,622","59,272",9,"1,032",3,"23,458",770,"16,205","5,400","139,382"
84,2014,"31,405,381","1,804,544","514,291","1,290,253","3,168,545","2,803,410","365,135","365,135","1,122,733",...,"115,065","54,446",3,417,3,"20,201","1,142","15,305","5,294","133,661"
85,2015,"32,914,647","1,825,337","502,948","1,322,389","3,175,301","2,804,644","370,657","370,657","1,010,382",...,"107,664","58,181",1,477,4,"17,325",848,"14,510","4,276","127,586"
86,2016,"32,591,578","1,709,055","483,900","1,225,155","3,230,193","2,868,514","361,678","361,678","823,196",...,"102,003","48,504",1,526,3,"13,523",801,455,"3,603","120,288"
87,2017,"33,292,113","1,556,679","474,511","1,082,168","3,250,769","2,881,753","369,016","369,016","694,676",...,"96,451","38,438",1,455,3,"11,395",659,476,"2,982","115,452"
88,2018,"37,129,374","1,456,689","460,179","996,510","3,254,712","2,882,314","372,398","372,398","589,973",...,"89,525","35,564",0,433,3,"11,798",499,442,"3,538","111,476"
89,2019,"40,704,488",,,,"3,250,422",,,,"529,668",...,,,,,,,,,,

In [275]:
df_ngf_clean = clean_dfs(df_ngf, 1930)
df_ngf_clean.tail(10)

,year,us,alaska,alaska onshore,alaska state offshore,arkansas,california,california onshore,california state offshore,federal offshore california,...,michigan,mississippi,missouri,nebraska,nevada,new york,oregon,south dakota,tennessee,virginia
80,2010,"165,928","10,173","8,034","2,139",425,"2,790","2,790",0,,...,"3,324","8,685",NA,24,0,0,0,"2,136",0,NA
81,2011,"209,439","10,966","9,276","1,690",494,"2,424","2,424",0,,...,"3,324","9,593",NA,21,0,0,0,"2,120",0,NA
82,2012,"212,848","11,769","9,244","2,525",0,0,NA,NA,NA,...,0,0,NA,0,0,0,0,0,0,0
83,2013,"260,394","7,219","5,670","1,549",0,0,NA,NA,,...,0,0,0,0,0,0,0,0,0,0
84,2014,"293,916","6,554","5,779",776,NA,NA,NA,NA,NA,...,NA,NA,0,NA,0,0,0,NA,0,NA
85,2015,"289,545","5,385","4,755",630,0,0,NA,NA,NA,...,0,0,0,0,0,0,0,"13,957",0,0
86,2016,"230,410","8,541","7,557",984,NA,NA,NA,NA,,...,NA,NA,0,NA,0,0,0,0,0,NA
87,2017,NA,"7,605","6,739",866,0,0,NA,0,NA,...,0,0,0,0,0,0,0,0,0,0
88,2018,"468,347","8,210","7,229",981,0,0,NA,0,0,...,0,0,0,0,0,0,0,0,0,0
89,2019,,,,,,,,,,...,,,,,,,,,,